Tekla Open API Reference for Tekla Structures 2025
Line Constructor (LineSegment)
 Instantiates a line defined by the given line segment.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Line(
	LineSegment LineSegment
)
Public Sub New (
	LineSegment As LineSegment
)
Parameters
LineSegment
Type: Tekla.Structures.Geometry3d.LineSegment
The line segment to be used.
See Also
Reference
Line Class
Line Overload
Tekla.Structures.Geometry3d Namespace